{
  "posts": [
    {
      "id": 1,
      "title": "Energy Security in the Built Environment", 
      "relation": "Technology", 
      "author": "Dimitris Koupatsiaris", 
      "body": [ 
        "ABSTRACT. The preservation and expansion of natural resources has been a major concern from early historic years. From the industrial age however, energy natural resources received top priority at the cost of increased vulnerability to interruptions of energy supply. Especially during the last half century, the world witnessed energy crises with global impact and increase of energy costs. Recent energy crises highlighted the need for closer cooperation between sovereign nations and international organizations in order to avoid them in the future, or at least to mitigate their consequences. The concept of energy security emerged out of this process, and until recently it has been the focus of researchers in the realms of strategic planning, political relations and policy making in the energy sector. Energy security addresses three problems: availability of energy sources, uninterrupted flow of energy and affordable prices. The first deals with the selection of an energy source or a mixture of energy sources for which the time required for their depletion is as distant as possible, and as such it involves long-term prediction or minimization of the probability of long-term shortage. The second deals with forming the provisions that secure an uninterrupted energy flow, and as such it involves minimization of the probability of short-term shortage. Finally, the third problem deals with measures to avoid high energy costs that may constraint further operations. The selection of energy sources is usually based on current pricing and legislating restrictions during the design phase of a project, while the energy cost is chosen as the minimum allowed by the imposed restrictions. Energy flow interruptions are mitigated according to the maximum shortage allowed by legislature or industry standards for each sub-system. The cost and availability of different sources of energy change during the project life cycle, while solutions that mitigate short-term interruptions fail to prove cost effective. The introduction of a risk management process could help avoid unpleasant consequences, or predict them. The aim of this paper is to illustrate that energy security is a risk management problem, and as such it can be applied from large to small scale of structure manufacturing and operations, taking into account the long-term lιfe cycle of an energy demanding structure. From this perspective, it can be applied both in the design phase as well as the operational use of all structures and processes for which energy consumption constitutes a significant percentage of their operational life cycle cost.", 
        "INTRODUCTION. One definition of energy security is from the International Energy Agency, which states that it is the uninterrupted availability of energy sources at an affordable price, both in short-term as well as in long-term. Longterm energy security mainly deals with timely investments to supply energy in line with economic developments and environmental needs, while short-term energy security focuses on the ability of the energy system to react promptly to sudden changes in the supply-demand balance. Energy security was the principle reason for founding IEA, as it was formed in response to the 1973 oil crisis. However, between 1973 and 2014 the spectrum of the issues that energy security consists of has been broadened, at it is illustrated in the timeline of (IEA-Pol 2014). Today IEA’s objectives are as follows:", 
        "Energy security. To secure reliable access to supplies of all forms of energy, including oil, natural gas, electricity, coal, nuclear energy and renewables.", 
        "Environmental protection. To include a particular focus on reducing greenhouse gas emissions -especially CO2- which lead to climate change.", 
        "Sustainable economic development which both relies on and contributes to long-term energy security.", 
        "Prompt and effective response to market disruptions.", 
        "Improvement of energy efficiency. Work to deploy low-carbon technologies. Seek global solutions by increasing cooperation with all countries outside the OECD.", 
        "It is worth noting that the energy-related policies of the USA and the EU (US White House 2013) and (EUExpl April 2014), although they adopt different strategies, reflect the above listed goals. It is evident that energy security is a pivotal factor in the current and future energy policy making, together with environmental protection and reduction of greenhouse gases. Stated in simpler terms, we can say that in order to achieve energy security, we need robustness to short-term disruptions, reliable and efficient short and long-term system all the way from supply to power generation, and diversity in energy sources to mitigate long-term high cost." 
      ], 
      "date": "2022-03-01"
    },
    {
      "id": 2,
      "title": "Energy Security in Small Scale", 
      "relation": "Science", 
      "author": "Dimitris Koupatsiaris", 
      "body": [ 
        "If the global energy network is observed as a system, it consists of many interacting subsystems in smaller scales; therefore it is interesting to investigate to what degree the principles of large scale apply to smaller scales as well. The focus will be on structures/systems that are complex and complete technological products for which energy consumption in the form of fuel or energy source is a considerable fraction of their life cost, and when grouped they form major sectors in the global energy map. To be more specific, the focus will be on buildings (residential, office or industrial) and vehicles (automobiles, rail, ships and aircraft), since they are designed and constructed with a life span of at least two decades, and the process of consuming energy is part of their core function.", 
        "Robustness to short-term disruptions in various degrees is commonplace in the majority of structures. Just a few examples are backup generators in buildings, battery assisted uninterrupted power supplies (UPS), switchboard change-over switches between alternative electric power supplies from the grid, dual and backup supplies to critical systems (propulsion, power supply, HVAC, payload) which are commonplace in naval architecture, overhead design in marine power generation and propulsion (also to increase maintainability), and similar and even more elaborate solutions in aviation industry to also meet the aviation safety requirements. In addition, robustness to short-term disruptions will also benefit with the implementation of a number of technology initiatives (such as the smart grid, the total electric ship and others) which are underway.", 
        "Efficiency is a driving force for every design engineer. Fuel efficiency has been among the main design objectives in naval architecture for many years now, however the automotive and aviation industries followed suit only during the last two decades, also urged by state policies, mainly due to the fact that it has not has not been among the primary customer demands until recently. Similar advances were achieved in building design, especially in the domain of HVAC efficiency, a field in which ASHRAE is a champion. In addition, there have been many advances from corporations in the area of fuel supply chain towards optimizing, which is mainly an administrative effort.", 
        "In order to attempt an analysis in terms of energy sources diversity, it is worth taking a closer look at Figure 1, which is based on data from (IEA-Stats 2014). From 1973 to 2012 the global demand for energy increased from 3343 Mtoe to 6644 Mtoe, almost doubling (1 Mtoe= 106 tons of oil equivalent- toe, 1 toe= 107 kcal), while the share of crude oil declined from 67% of total consumption to 55%, the share of natural gas increased slightly from 19.5% to 20.5%, and the share of electricity increased from 13% to 24.5%. In the sector that includes energy for residential and commercial buildings, the share for crude oil was reduced from 53.5% to just over 22%, and the gap was filled mainly by electricity. On the other hand, the share of crude oil in the transportation sector remained almost equally strong to over 95%, making crude oil and the associated products almost the exclusive energy source for transportation.", 
        "Electricity is an indirect, non-storable1, energy source. Between 1973 and 2012, the primary energy source remains the use of coal with increased share of 40.4%. The share of crude oil was reduced from 25% to 5%, and the gap was filled with increased use of natural gas, nuclear power and renewable energy sources. It is worth noting the impressive increase in electricity generation from renewable energy sources (almost 3000%) that took place especially after the year 2000. In conclusion, there is a tendency for the electricity production sector to remove crude oil from the primary energy sources.", 
        "Thus, there is a global tendency for reducing dependence on crude oil in most energy sectors (industry, buildings and electricity generation), which is also in conjunction with IEA’s recommendations to reduce carbon emissions. The exception is the transportation sector, where dependence on crude oil remains almost absolute. The transportation sector consists in broad terms of the automotive, maritime shipping, aviation, and railroad industries. The railroad in particular, as a track-based transport mode and in position to affordably access the power grid, is experiencing a global shift towards electrification, which is currently the most efficient means of traction as well. One could wonder why there has been no energy source shift in the automotive, maritime shipping, and aviation industries. Although there are many examples of experimental or research vehicles in all the above industries that use alternative energy sources, however they did not, up to now, meet wider acceptance. This is not due to any notion that these industries are not open to innovation, since progress in the 20th century was mainly connected with the use of liquid petroleum-based fuels providing power to combustion engines. Furthermore, crude oil based fuels combine an unmatched set of properties, such as: specific energy, energy density, handling safety, usability, efficiency, availability, cost, and others. Thus, the process of replacing crude oil totally or in part will put at risk this set of properties. An obvious question to ask would be for what reason such a risk should be accepted.", 
      ], 
      "date": "2022-03-02"
    }
  ], 
  "featuredpost": 
  {
      "title": "The Difficulty of Publishing One's Thoughts", 
      "relation": "Opinion", 
      "author": "Dimitris Koupatsiaris", 
      "body": [ 
        "The motivation for this post was my decision to deploy my first personal webpage in Github. Although I anticipated the difficulty of producing the code for the webpage, I did not anticipate the seemingly simple process of writing down a few lines of text in order to make the blog real and not full of enpressions like post1, para2 and others that make the reader believe that the author is incapable of expressing himself/herself.", 
        "Even when I managed to focus my mind and draft the first paragraph, moving to the next was not easier, it was rather harder, at least for me. It is somewhat embarassing, to take pride of yourself of having good knowledge in a wide area of topics and strugling to put together some of those thought in text. And I do have knowledge in a wide spectrum of topics, but it turns out that I am unable to prove it, unless I obtain the capacity of transfering them in text.", 
        "Well, there it is. This post marks my decision to make a change in my habits. Starting from this post, I will make time to publish my thoughts, although I dread the reaction of the people who will spend their time reading them. Even if my written thoughts are going to be considered rubbish, I am going to write them down and shre them with the few brave that are about to read them."
      ], 
      "date": "2022-03-20" 
  }, 
  "comments": [
    {
      "id": 1,
      "body": "some comment",
      "postId": 1
    }, 
    {
      "id": 2, 
      "body": "some more comment", 
      "postId": 1 
    } 
  ] 
}
