{
  "posts": [
    {
      "id": 1,
      "title": "First Post", 
      "relation": "Technology", 
      "author": "Dimitris Koupatsiaris", 
      "body": [ 
        "Fist paragraph.", 
        "Second paragraph." 
      ], 
      "date": "2022-03-01"
    },
    {
      "id": 2,
      "title": "Second Post", 
      "relation": "Science", 
      "author": "Dimitris Koupatsiaris", 
      "body": [ 
        "Fist paragraph.", 
        "Second paragraph." 
      ], 
      "date": "2022-03-02"
    }
  ], 
  "featuredpost": 
  {
      "title": "The Difficulty of Publishing One's Thoughts", 
      "relation": "Opinion", 
      "author": "Dimitris Koupatsiaris", 
      "body": [ 
        "The motivation for this post was my decision to deploy my first personal webpage in Github. Although I anticipated the difficulty of producing the code for the webpage, I did not anticipate the seemingly simple process of writing down a few lines of text in order to make the blog real and not full of enpressions like post1, para2 and others that make the reader believe that the author is incapable of expressing himself/herself.", 
        "Even when I managed to focus my mind and draft the first paragraph, moving to the next was not easier, it was rather harder, at least for me. It is somewhat embarassing, to take pride of yourself of having good knowledge in a wide area of topics and strugling to put together some of those thought in text. And I do have knowledge in a wide spectrum of topics, but it turns out that I am unable to prove it, unless I obtain the capacity of transfering them in text.", 
        "Well, there it is. This post marks my decision to make a change in my habits. Starting from this post, I will make time to publish my thoughts, although I dread the reaction of the people who will spend their time reading them. Even if my written thoughts are going to be considered rubbish, I am going to write them down and shre them with the few brave that are about to read them."
      ], 
      "date": "2022-03-20" 
  }, 
  "comments": [
    {
      "id": 1,
      "body": "some comment",
      "postId": 1
    }, 
    {
      "id": 2, 
      "body": "some more comment", 
      "postId": 1 
    } 
  ] 
}
