{
  "posts": [
    {
      "id": 1,
      "title": "Energy Security in the Built Environment", 
      "relation": "Technology", 
      "author": "Dimitris Koupatsiaris", 
      "body": [ 
        "ABSTRACT. The preservation and expansion of natural resources has been a major concern from early historic years. From the industrial age however, energy natural resources received top priority at the cost of increased vulnerability to interruptions of energy supply. Especially during the last half century, the world witnessed energy crises with global impact and increase of energy costs. Recent energy crises highlighted the need for closer cooperation between sovereign nations and international organizations in order to avoid them in the future, or at least to mitigate their consequences. The concept of energy security emerged out of this process, and until recently it has been the focus of researchers in the realms of strategic planning, political relations and policy making in the energy sector. Energy security addresses three problems: availability of energy sources, uninterrupted flow of energy and affordable prices. The first deals with the selection of an energy source or a mixture of energy sources for which the time required for their depletion is as distant as possible, and as such it involves long-term prediction or minimization of the probability of long-term shortage. The second deals with forming the provisions that secure an uninterrupted energy flow, and as such it involves minimization of the probability of short-term shortage. Finally, the third problem deals with measures to avoid high energy costs that may constraint further operations. The selection of energy sources is usually based on current pricing and legislating restrictions during the design phase of a project, while the energy cost is chosen as the minimum allowed by the imposed restrictions. Energy flow interruptions are mitigated according to the maximum shortage allowed by legislature or industry standards for each sub-system. The cost and availability of different sources of energy change during the project life cycle, while solutions that mitigate short-term interruptions fail to prove cost effective. The introduction of a risk management process could help avoid unpleasant consequences, or predict them. The aim of this paper is to illustrate that energy security is a risk management problem, and as such it can be applied from large to small scale of structure manufacturing and operations, taking into account the long-term lιfe cycle of an energy demanding structure. From this perspective, it can be applied both in the design phase as well as the operational use of all structures and processes for which energy consumption constitutes a significant percentage of their operational life cycle cost.", 
        "INTRODUCTION. One definition of energy security is from the International Energy Agency, which states that it is the uninterrupted availability of energy sources at an affordable price, both in short-term as well as in long-term. Longterm energy security mainly deals with timely investments to supply energy in line with economic developments and environmental needs, while short-term energy security focuses on the ability of the energy system to react promptly to sudden changes in the supply-demand balance. Energy security was the principle reason for founding IEA, as it was formed in response to the 1973 oil crisis. However, between 1973 and 2014 the spectrum of the issues that energy security consists of has been broadened, at it is illustrated in the timeline of (IEA-Pol 2014). Today IEA’s objectives are as follows:", 
        "Energy security. To secure reliable access to supplies of all forms of energy, including oil, natural gas, electricity, coal, nuclear energy and renewables.", 
        "Environmental protection. To include a particular focus on reducing greenhouse gas emissions -especially CO2- which lead to climate change.", 
        "Sustainable economic development which both relies on and contributes to long-term energy security.", 
        "Prompt and effective response to market disruptions.", 
        "Improvement of energy efficiency. Work to deploy low-carbon technologies. Seek global solutions by increasing cooperation with all countries outside the OECD.", 
        "It is worth noting that the energy-related policies of the USA and the EU (US White House 2013) and (EUExpl April 2014), although they adopt different strategies, reflect the above listed goals. It is evident that energy security is a pivotal factor in the current and future energy policy making, together with environmental protection and reduction of greenhouse gases. Stated in simpler terms, we can say that in order to achieve energy security, we need robustness to short-term disruptions, reliable and efficient short and long-term system all the way from supply to power generation, and diversity in energy sources to mitigate long-term high cost." 
      ], 
      "date": "2022-03-01"
    },
    {
      "id": 2,
      "title": "Second Post", 
      "relation": "Science", 
      "author": "Dimitris Koupatsiaris", 
      "body": [ 
        "Fist paragraph.", 
        "Second paragraph." 
      ], 
      "date": "2022-03-02"
    }
  ], 
  "featuredpost": 
  {
      "title": "The Difficulty of Publishing One's Thoughts", 
      "relation": "Opinion", 
      "author": "Dimitris Koupatsiaris", 
      "body": [ 
        "The motivation for this post was my decision to deploy my first personal webpage in Github. Although I anticipated the difficulty of producing the code for the webpage, I did not anticipate the seemingly simple process of writing down a few lines of text in order to make the blog real and not full of enpressions like post1, para2 and others that make the reader believe that the author is incapable of expressing himself/herself.", 
        "Even when I managed to focus my mind and draft the first paragraph, moving to the next was not easier, it was rather harder, at least for me. It is somewhat embarassing, to take pride of yourself of having good knowledge in a wide area of topics and strugling to put together some of those thought in text. And I do have knowledge in a wide spectrum of topics, but it turns out that I am unable to prove it, unless I obtain the capacity of transfering them in text.", 
        "Well, there it is. This post marks my decision to make a change in my habits. Starting from this post, I will make time to publish my thoughts, although I dread the reaction of the people who will spend their time reading them. Even if my written thoughts are going to be considered rubbish, I am going to write them down and shre them with the few brave that are about to read them."
      ], 
      "date": "2022-03-20" 
  }, 
  "comments": [
    {
      "id": 1,
      "body": "some comment",
      "postId": 1
    }, 
    {
      "id": 2, 
      "body": "some more comment", 
      "postId": 1 
    } 
  ] 
}
